In [9]:
# DataFrames => sao as tabelas, sao composicoes de SERIES(COLUNAS)
import pandas as pd
from numpy.random import randn # random => funcao que gera numeros aleatorios

In [10]:
df = pd.DataFrame(randn(5, 4), index=["A", "B", "C", "D", "E"], columns="W X Y Z".split()) # dp => method cria o DataFrame. vai gerar uma tabela de 5, 4 5linhas por 4 colunas.

In [11]:
# executa e veja o DataFrame
df

          W         X         Y         Z
A -1.020020 -0.188938  0.484974  1.699425
B -1.700820 -1.365776  0.557644  0.402300
C -0.555771 -1.481982  0.319883  0.428695
D  2.236007  1.088086  0.021282  0.335742
E  0.118831 -1.440776 -0.899453  0.583541

In [12]:
# tipo de dados => frame.DataFrame
type(df)

pandas.core.frame.DataFrame

In [13]:
# com frame ao usar [] eu tenho que especificar a coluna
df['W'] # retornando uma Series (coluna)

A   -1.020020
B   -1.700820
C   -0.555771
D    2.236007
E    0.118831
Name: W, dtype: float64

In [15]:
# comando para retornar a Series (coluna) => retorno => pandas.core.series.Series
type(df['W'])

pandas.core.series.Series

In [18]:
# uma lista e 2 series (colunas)
df[["W", "X"]]

          W         X
A -1.020020 -0.188938
B -1.700820 -1.365776
C -0.555771 -1.481982
D  2.236007  1.088086
E  0.118831 -1.440776

In [19]:
# coluna New como uma copia da coluna W. isso eh inserir dados no DataFrame
df['new'] = df['W']

In [20]:
df

          W         X         Y         Z       new
A -1.020020 -0.188938  0.484974  1.699425 -1.020020
B -1.700820 -1.365776  0.557644  0.402300 -1.700820
C -0.555771 -1.481982  0.319883  0.428695 -0.555771
D  2.236007  1.088086  0.021282  0.335742  2.236007
E  0.118831 -1.440776 -0.899453  0.583541  0.118831

In [21]:
# somar 2 Series (colunas)
df['new'] = df['W'] + df['Y']

In [22]:
df

          W         X         Y         Z       new
A -1.020020 -0.188938  0.484974  1.699425 -0.535045
B -1.700820 -1.365776  0.557644  0.402300 -1.143175
C -0.555771 -1.481982  0.319883  0.428695 -0.235888
D  2.236007  1.088086  0.021282  0.335742  2.257289
E  0.118831 -1.440776 -0.899453  0.583541 -0.780622

In [24]:
# deletar Sereies( coluna)
del df['Y']

In [25]:
df

          W         X         Z       new
A -1.020020 -0.188938  1.699425 -0.535045
B -1.700820 -1.365776  0.402300 -1.143175
C -0.555771 -1.481982  0.428695 -0.235888
D  2.236007  1.088086  0.335742  2.257289
E  0.118831 -1.440776  0.583541 -0.780622

In [26]:
# outra forma de deletar eh com o drop (tira linhas ou colunas)
# ele ataca colunas e linhas, eixo 1 colunas (axis1) e eixo0 linhas (axis0)
df.drop('new', axis=1) # colunas

          W         X         Z
A -1.020020 -0.188938  1.699425
B -1.700820 -1.365776  0.402300
C -0.555771 -1.481982  0.428695
D  2.236007  1.088086  0.335742
E  0.118831 -1.440776  0.583541

In [27]:
# ele manipulou uma copia do que foi pedido ele nao executou definitivo
df # aparece a tabela new novamente

          W         X         Z       new
A -1.020020 -0.188938  1.699425 -0.535045
B -1.700820 -1.365776  0.402300 -1.143175
C -0.555771 -1.481982  0.428695 -0.235888
D  2.236007  1.088086  0.335742  2.257289
E  0.118831 -1.440776  0.583541 -0.780622

In [28]:
# posso salvar uma nova variavel
df2 = df.drop('new', axis=1) # colunas

In [29]:
df2

          W         X         Z
A -1.020020 -0.188938  1.699425
B -1.700820 -1.365776  0.402300
C -0.555771 -1.481982  0.428695
D  2.236007  1.088086  0.335742
E  0.118831 -1.440776  0.583541

In [31]:
# para alterar o DataFrame original usa inplace=True
df.drop('new', axis=1, inplace=True) # colunas
# ele trab originalmente no DF

In [32]:
df

          W         X         Z
A -1.020020 -0.188938  1.699425
B -1.700820 -1.365776  0.402300
C -0.555771 -1.481982  0.428695
D  2.236007  1.088086  0.335742
E  0.118831 -1.440776  0.583541

In [33]:
# fazer selecao em linhas, acessar linhas loc e iloc
# pegar todas as informacoes da linha A
df.loc['A']

W   -1.020020
X   -0.188938
Z    1.699425
Name: A, dtype: float64

In [34]:
# para passar de duas linhas de todas as colunas dessas linhas
df.loc[['A', 'B']] # seleciona por roluto, qdo eu uso [] ja estou me referindo ao indices

         W         X         Z
A -1.02002 -0.188938  1.699425
B -1.70082 -1.365776  0.402300

In [35]:
# iloc => trab com numeros
# passando indice da coluna e indice da linha
df.iloc[0, 2] # seleciona por numerico, qdo eu uso [] ja estou me referindo ao indices

np.float64(1.6994248255433895)

In [37]:
df.loc[['A', 'B'], 'W']# apos essa ],  pego inf Series

A   -1.02002
B   -1.70082
Name: W, dtype: float64

In [38]:
# para retornar dataframe de coluna passa ele dentro de []
df.loc[['A', 'B'], ['W']]# apos essa ],  pego inf Series

         W
A -1.02002
B -1.70082

In [39]:
# passando indice da coluna e indice da linha, 0 linha, 2 coluna
df.iloc[0, 2]

np.float64(1.6994248255433895)

In [40]:
df

          W         X         Z
A -1.020020 -0.188938  1.699425
B -1.700820 -1.365776  0.402300
C -0.555771 -1.481982  0.428695
D  2.236007  1.088086  0.335742
E  0.118831 -1.440776  0.583541

In [42]:
# pega todas as linhas menos a ultima e pega todas as colunas
# :-1, :
df.iloc[:-1, :]

          W         X         Z
A -1.020020 -0.188938  1.699425
B -1.700820 -1.365776  0.402300
C -0.555771 -1.481982  0.428695
D  2.236007  1.088086  0.335742

In [43]:
# testes para trab com indices
df.iloc[1:4, 1:3]
#1:4 → pega as linhas de posição 1 até 3 (o número final não é incluso).
#1:3 → pega as colunas de posição 1 até 2 (também exclui o final).

# otimo para trabalhar com matrizes de dataframe

          X         Z
B -1.365776  0.402300
C -1.481982  0.428695
D  1.088086  0.335742

In [44]:
# selecao condicional
df

          W         X         Z
A -1.020020 -0.188938  1.699425
B -1.700820 -1.365776  0.402300
C -0.555771 -1.481982  0.428695
D  2.236007  1.088086  0.335742
E  0.118831 -1.440776  0.583541

In [45]:
# somar os df dataframes
df + df

          W         X         Z
A -2.040039 -0.377876  3.398850
B -3.401640 -2.731552  0.804599
C -1.111542 -2.963965  0.857389
D  4.472014  2.176173  0.671484
E  0.237662 -2.881552  1.167082

In [46]:
df

          W         X         Z
A -1.020020 -0.188938  1.699425
B -1.700820 -1.365776  0.402300
C -0.555771 -1.481982  0.428695
D  2.236007  1.088086  0.335742
E  0.118831 -1.440776  0.583541

In [47]:
# operacoes condicionais
df > 0

       W      X     Z
A  False  False  True
B  False  False  True
C  False  False  True
D   True   True  True
E   True  False  True

In [48]:
# eu quero qdo ele for maior que 0
df[df > 0]

          W         X         Z
A       NaN       NaN  1.699425
B       NaN       NaN  0.402300
C       NaN       NaN  0.428695
D  2.236007  1.088086  0.335742
E  0.118831       NaN  0.583541